/*********************************************************************************************************
* 模块名称：DAC.c
* 摘    要：DAC模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DAC.h"
#include "gd32f30x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define DAC0_R12DH_ADDR ((u32)0x40007408)   //DAC1的地址（12位右对齐）

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/
//DAC波形输出
static const u16 s_arrSineWave100Point[100] = {
2048,
2176,
2304,
2431,
2557,
2680,
2801,
2919,
3034,
3145,
3251,
3353,
3449,
3540,
3625,
3704,
3776,
3842,
3900,
3951,
3995,
4031,
4059,
4079,
4091,
4095,
4091,
4079,
4059,
4031,
3995,
3951,
3900,
3842,
3776,
3704,
3625,
3540,
3449,
3353,
3251,
3145,
3034,
2919,
2801,
2680,
2557,
2431,
2304,
2176,
2048,
1919,
1791,
1664,
1538,
1415,
1294,
1176,
1061,
950,
844,
742,
646,
555,
470,
391,
319,
253,
195,
144,
100,
64,
36,
16,
4,
0,
4,
16,
36,
64,
100,
144,
195,
253,
319,
391,
470,
555,
646,
742,
844,
950,
1061,
1176,
1294,
1415,
1538,
1664,
1791,
1919
};

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigTimer6(unsigned short arr, unsigned short psc);  //配置TIMER6
static void ConfigDAC(void);                                       //配置DAC
static void ConfigDMA(void);                                       //配置DMA

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigTimer6
* 函数功能：配置TIMER6
* 输入参数：arr-自动重装值，psc-预分频器值
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：APB1时钟为60MHz，TIMER6时钟选择为APB1的2倍，因此，TIMER6时钟为120MHz
*********************************************************************************************************/
static  void ConfigTimer6(unsigned short arr, unsigned short psc)
{
  timer_parameter_struct timer_initpara;     //timer_initpara用于存放定时器的参数

  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_TIMER6);      //使能TIMER6的时钟

  timer_deinit(TIMER6);                     //设置TIMER6参数恢复默认值
  timer_struct_para_init(&timer_initpara);  //初始化timer_initpara
 
  //配置TIMER6
  timer_initpara.prescaler         = psc;               //设置预分频器值
  timer_initpara.counterdirection  = TIMER_COUNTER_UP;  //设置向上计数模式
  timer_initpara.period            = arr;               //设置自动重装载值
  timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;  //设置时钟分割
  timer_init(TIMER6, &timer_initpara);                  //根据参数初始化定时器

  //TIM6触发源配置
  timer_master_output_trigger_source_select(TIMER6, TIMER_TRI_OUT_SRC_UPDATE);

  timer_enable(TIMER6);                                 //使能定时器
}

/*********************************************************************************************************
* 函数名称：ConfigDAC
* 函数功能：配置DAC
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigDAC(void)
{
  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_GPIOA);  //使能GPIOA的时钟
  rcu_periph_clock_enable(RCU_DAC);    //使能DAC的时钟
  
  //设置GPIO输出模式及速度
  gpio_init(GPIOA, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, GPIO_PIN_4);

  //DAC配置
  dac_deinit();                                         //复位DAC模块
  dac_concurrent_disable();                             //禁用concurrent mode
  dac_output_buffer_enable(DAC0);                       //使能输出缓冲区
  dac_trigger_enable(DAC0);                             //使能外部触发源
  dac_trigger_source_config(DAC0, DAC_TRIGGER_T6_TRGO); //使用TIMER6做为触发源
  dac_wave_mode_config(DAC0, DAC_WAVE_DISABLE);         //禁用Wave mode

  //使能DAC
  dac_enable(DAC0);

  //DAC DMA使能
  dac_dma_enable(DAC0);
}

/*********************************************************************************************************
* 函数名称：ConfigDMA
* 函数功能：配置DMA
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigDMA(void)
{
  //DMA配置结构体
  dma_parameter_struct dma_struct;

  //使能DMA1时钟
  rcu_periph_clock_enable(RCU_DMA1);

  //配置DMA
  dma_deinit(DMA1, DMA_CH2);                                             //复位DMA
  dma_struct_para_init(&dma_struct);                                     //复位配置结构体
  dma_struct.periph_addr  = DAC0_R12DH_ADDR;                             //外设地址
  dma_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;                  //外设数据位宽为16位
  dma_struct.memory_addr  = (u32)s_arrSineWave100Point;                  //内存地址
  dma_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;                      //内存数据位宽为16位
  dma_struct.number       = sizeof(s_arrSineWave100Point) / sizeof(u16); //传输数据量
  dma_struct.priority     = DMA_PRIORITY_HIGH;                           //高优先级
  dma_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;                 //外设地址增长关闭
  dma_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;                  //内存地址正常开启
  dma_struct.direction    = DMA_MEMORY_TO_PERIPHERAL;                    //传输方向为内存到地址
  dma_init(DMA1, DMA_CH2, &dma_struct);                                  //根据参数配置DMA1_CH2
  dma_circulation_enable(DMA1, DMA_CH2);                                 //开启循环模式

  //使能DMA1_CH2
  dma_channel_enable(DMA1, DMA_CH2); 
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitDAC
* 函数功能：初始化DAC模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitDAC(void)
{
  ConfigTimer6(9999, 119); //配置定时器做为DAC触发源
  ConfigDAC();             //配置DAC
  ConfigDMA();             //配置DAC DMA传输
}

